<hr>

# **RELACIONES ENTRE TABLAS**

<HR>

Hay tres tipos de relaciones:

- uno a uno (one-to-one)
- uno a muchos (one-to-many)
- muchos a muchos (many-to-many)

En una relación uno a uno, cada fila en una tabla está conectada con una y solo una fila de la otra tabla. Es como si una tabla estuviera dividida en dos.

En una relación uno a muchos, cada fila de una tabla coincide con varias filas de otra tabla.

Este es el tipo de relación que vemos con los libros y los autores. Un autor puede escribir varios libros pero cada libro tiene un solo autor.

Pero a veces los libros están escritos por más de un autor (por ejemplo, Neil Gaiman y Terry Pratchett). En estos casos, hablamos de relación muchos a muchos.

En una relación muchos a muchos, varias filas de una tabla coinciden con varias filas de otra tabla. Este tipo de relación produce una tabla de vinculación que combina las claves primarias de ambas tablas.

<hr>

## Diagrama ER

Se puede mostrar la estructura de las bases de datos con diagramas ER (entidad-relación).  Los diagramas muestran tablas y las relaciones entre ellas.

**Relaciones en diagramas ER**

Los diagramas ER también muestran relaciones. El final de la línea que conecta dos tablas indica si uno o varios valores de una tabla coinciden con los valores de la otra.

<hr>

## Buscar Valores Vacíos

En SQL, decimos que las celdas vacías son NULL. Se buscan con el operador IS NULL:

```

SELECT
    *
FROM
    table_name
WHERE
    column_name IS NULL;
```

A veces, en lugar de imprimir filas con valores NULL, queremos excluirlos del resultado.

En estos casos se utiliza el operador NOT:

```
SELECT
    *
FROM
    table_name
WHERE
    column_name IS NOT NULL;
```

Eliminar simplemente las filas NULL no siempre es la mejor opción. A veces querremos reemplazarlas con un cierto valor (digamos, la media) y podemos hacer que esto suceda en la consulta en sí. Para eso tenemos el operador CASE ("en casos cuando"). Es como  if-elif-else en Python:

```
CASE WHEN condition_1 THEN
    result_1
WHEN condition_2 THEN
    result_2
WHEN condition_3 THEN
    result_3
ELSE
    result_4
END;
```

Traducción de SQL:

Elige los campos name y publisher_id de la tabla books. Si el valor en la columna publisher_id está vacío, reemplázalo con -1. De lo contrario, deja el valor como está. Llama publisher_id_full a la columna resultante.

## Ejercicios!

**Ejercicio 1**
Busca valores NULL en el campo weight de la tabla products. Imprime los siguientes campos: name,units,weight.